
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |       20 |          40 |           26 |
## Affected resources by action

|  Action  | Resources                                                                                    |
|:--------:|:---------------------------------------------------------------------------------------------|
|    🟢    | `module.ecs.module.pod.random_string.profile_suffix`                                         |
|    🟢    | `module.keycloak.module.pod.random_string.profile_suffix`                                    |
|    🟢    | `module.ecs.module.pod.module.instance_profile.aws_iam_instance_profile.profile`             |
|    🟢    | `module.ecs.module.pod.module.instance_profile.aws_iam_policy.profile`                       |
|    🟢    | `module.ecs.module.pod.module.instance_profile.aws_iam_role.profile`                         |
|    🟢    | `module.ecs.module.pod.module.instance_profile.aws_iam_role_policy_attachment.profile`       |
|    🟢    | `module.keycloak.module.pod.module.instance_profile.aws_iam_instance_profile.profile`        |
|    🟢    | `module.keycloak.module.pod.module.instance_profile.aws_iam_policy.profile`                  |
|    🟢    | `module.keycloak.module.pod.module.instance_profile.aws_iam_role.profile`                    |
|    🟢    | `module.keycloak.module.pod.module.instance_profile.aws_iam_role_policy_attachment.profile`  |
|    🟡    | `module.ecs.aws_ecs_capacity_provider.ecs`                                                   |
|    🟡    | `module.ecs.aws_ecs_cluster.ecs`                                                             |
|    🟡    | `module.ecs.aws_ecs_service.ecs`                                                             |
|    🟡    | `module.keycloak.aws_ecs_capacity_provider.ecs`                                              |
|    🟡    | `module.keycloak.aws_ecs_cluster.ecs`                                                        |
|    🟡    | `module.keycloak.aws_ecs_service.ecs`                                                        |
|    🟡    | `module.ecs.module.pod.aws_acm_certificate.website`                                          |
|    🟡    | `module.ecs.module.pod.aws_alb.website`                                                      |
|    🟡    | `module.ecs.module.pod.aws_alb_target_group.website`                                         |
|    🟡    | `module.ecs.module.pod.aws_autoscaling_group.website`                                        |
|    🟡    | `module.ecs.module.pod.aws_launch_template.website`                                          |
|    🟡    | `module.ecs.module.pod.aws_lb_listener.ssl`                                                  |
|    🟡    | `module.ecs.module.pod.aws_s3_bucket.access_log[0]`                                          |
|    🟡    | `module.ecs.module.pod.aws_s3_bucket_policy.access_logs[0]`                                  |
|    🟡    | `module.ecs.module.pod.aws_security_group.alb`                                               |
|    🟡    | `module.ecs.module.pod.aws_security_group.backend`                                           |
|    🟡    | `module.ecs.module.pod.aws_vpc_security_group_egress_rule.alb_outgoing`                      |
|    🟡    | `module.ecs.module.pod.aws_vpc_security_group_egress_rule.backend_outgoing`                  |
|    🟡    | `module.ecs.module.pod.aws_vpc_security_group_ingress_rule.alb_icmp`                         |
|    🟡    | `module.ecs.module.pod.aws_vpc_security_group_ingress_rule.alb_listener_port`                |
|    🟡    | `module.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_icmp`                     |
|    🟡    | `module.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_local`                |
|    🟡    | `module.ecs.module.pod.aws_vpc_security_group_ingress_rule.https`                            |
|    🟡    | `module.keycloak.module.pod.aws_acm_certificate.website`                                     |
|    🟡    | `module.keycloak.module.pod.aws_alb.website`                                                 |
|    🟡    | `module.keycloak.module.pod.aws_alb_target_group.website`                                    |
|    🟡    | `module.keycloak.module.pod.aws_autoscaling_group.website`                                   |
|    🟡    | `module.keycloak.module.pod.aws_launch_template.website`                                     |
|    🟡    | `module.keycloak.module.pod.aws_lb_listener.ssl`                                             |
|    🟡    | `module.keycloak.module.pod.aws_s3_bucket.access_log[0]`                                     |
|    🟡    | `module.keycloak.module.pod.aws_s3_bucket_policy.access_logs[0]`                             |
|    🟡    | `module.keycloak.module.pod.aws_security_group.alb`                                          |
|    🟡    | `module.keycloak.module.pod.aws_security_group.backend`                                      |
|    🟡    | `module.keycloak.module.pod.aws_vpc_security_group_egress_rule.alb_outgoing`                 |
|    🟡    | `module.keycloak.module.pod.aws_vpc_security_group_egress_rule.backend_outgoing`             |
|    🟡    | `module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.alb_icmp`                    |
|    🟡    | `module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.alb_listener_port`           |
|    🟡    | `module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_icmp`                |
|    🟡    | `module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_local`           |
|    🟡    | `module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.https`                       |
|    🔴    | `module.ecs.aws_security_group.backend_extra`                                                |
|    🔴    | `module.ecs.aws_vpc_security_group_ingress_rule.backend_extra_reserved`                      |
|    🔴    | `module.ecs.aws_vpc_security_group_ingress_rule.backend_extra_user`                          |
|    🔴    | `module.keycloak.aws_security_group.backend_extra`                                           |
|    🔴    | `module.keycloak.aws_vpc_security_group_ingress_rule.backend_extra_reserved`                 |
|    🔴    | `module.keycloak.aws_vpc_security_group_ingress_rule.backend_extra_user`                     |
|    🔴    | `module.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_input[0]`             |
|    🔴    | `module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_input[0]`        |
|    🔴    | `module.ecs.module.pod.module.webserver_profile.aws_iam_instance_profile.profile`            |
|    🔴    | `module.ecs.module.pod.module.webserver_profile.aws_iam_policy.profile`                      |
|    🔴    | `module.ecs.module.pod.module.webserver_profile.aws_iam_role.profile`                        |
|    🔴    | `module.ecs.module.pod.module.webserver_profile.aws_iam_role_policy_attachment.profile`      |
|    🔴    | `module.keycloak.module.pod.module.webserver_profile.aws_iam_instance_profile.profile`       |
|    🔴    | `module.keycloak.module.pod.module.webserver_profile.aws_iam_policy.profile`                 |
|    🔴    | `module.keycloak.module.pod.module.webserver_profile.aws_iam_role.profile`                   |
|    🔴    | `module.keycloak.module.pod.module.webserver_profile.aws_iam_role_policy_attachment.profile` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs.aws_appautoscaling_policy.ecs_policy must be replaced
-/+ resource "aws_appautoscaling_policy" "ecs_policy" {
      ~ alarm_arns         = [
          - "arn:aws:cloudwatch:us-west-1:493370826424:alarm:TargetTracking-service/terraform-registry/terraform-registry-AlarmHigh-637126e7-2e0c-44df-af8c-73db270fc8fc",
          - "arn:aws:cloudwatch:us-west-1:493370826424:alarm:TargetTracking-service/terraform-registry/terraform-registry-AlarmLow-a28784c9-ba9f-4b10-9536-3550951f3a2a",
        ] -> (known after apply)
      ~ arn                = "arn:aws:autoscaling:us-west-1:493370826424:scalingPolicy:cb393ce2-5e4f-47a2-9b8a-0ece22b29c0a:resource/ecs/service/terraform-registry/terraform-registry:policyName/cpu-auto-scaling" -> (known after apply)
      ~ id                 = "cpu-auto-scaling" -> (known after apply)
      ~ name               = "cpu-auto-scaling" -> "auto-scaling" # forces replacement
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_ecs_capacity_provider.ecs will be updated in-place
  ~ resource "aws_ecs_capacity_provider" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:capacity-provider/terraform-registry"
        name     = "terraform-registry"
      ~ tags     = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/ecs/aws"
          + "environment"       = "development"
          + "module_version"    = "3.7.0"
          + "service"           = "terraform-registry"
        }
      ~ tags_all = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/ecs/aws"
          ~ "environment"       = "production" -> "development"
          + "module_version"    = "3.7.0"
          + "service"           = "terraform-registry"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_ecs_cluster.ecs will be updated in-place
  ~ resource "aws_ecs_cluster" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:cluster/terraform-registry"
        name     = "terraform-registry"
      ~ tags     = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/ecs/aws"
          + "environment"       = "development"
          + "module_version"    = "3.7.0"
          + "service"           = "terraform-registry"
        }
      ~ tags_all = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/ecs/aws"
          ~ "environment"       = "production" -> "development"
          + "module_version"    = "3.7.0"
          + "service"           = "terraform-registry"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_ecs_service.ecs will be updated in-place
  ~ resource "aws_ecs_service" "ecs" {
        id                                 = "arn:aws:ecs:us-west-1:493370826424:service/terraform-registry/terraform-registry"
        name                               = "terraform-registry"
      ~ tags                               = {} -> (known after apply)
      ~ tags_all                           = {
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> (known after apply)
      ~ task_definition                    = "arn:aws:ecs:us-west-1:493370826424:task-definition/terraform-registry:30" -> (known after apply)
        # (14 unchanged attributes hidden)

      + timeouts {
          + delete = "10m"
        }

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.ecs must be replaced
-/+ resource "aws_ecs_task_definition" "ecs" {
      ~ arn                      = "arn:aws:ecs:us-west-1:493370826424:task-definition/terraform-registry:30" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-1:493370826424:task-definition/terraform-registry" -> (known after apply)
      ~ container_definitions    = (sensitive value)
      ~ execution_role_arn       = "arn:aws:iam::493370826424:role/terraform-registryTaskExecutionRole" -> (known after apply) # forces replacement
      ~ id                       = "terraform-registry" -> (known after apply)
      + network_mode             = (known after apply)
      - requires_compatibilities = [] -> null
      ~ revision                 = 30 -> (known after apply)
      ~ tags                     = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/ecs/aws"
          + "environment"       = "development"
          + "module_version"    = "3.7.0"
          + "service"           = "terraform-registry"
        }
      ~ tags_all                 = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/ecs/aws"
          ~ "environment"       = "production" -> "development"
          + "module_version"    = "3.7.0"
          + "service"           = "terraform-registry"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.ecs.aws_iam_role.ecs_task_execution_role must be replaced
-/+ resource "aws_iam_role" "ecs_task_execution_role" {
      ~ arn                   = "arn:aws:iam::493370826424:role/terraform-registryTaskExecutionRole" -> (known after apply)
      ~ create_date           = "2024-03-02T19:49:35Z" -> (known after apply)
      ~ id                    = "terraform-registryTaskExecutionRole" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> (known after apply)
      ~ name                  = "terraform-registryTaskExecutionRole" -> (known after apply)
      + name_prefix           = "terraform-registryTaskExecutionRole" # forces replacement
      ~ tags                  = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/ecs/aws"
          + "environment"       = "development"
          + "module_version"    = "3.7.0"
          + "service"           = "terraform-registry"
        }
      ~ tags_all              = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/ecs/aws"
          ~ "environment"       = "production" -> "development"
          + "module_version"    = "3.7.0"
          + "service"           = "terraform-registry"
            # (1 unchanged element hidden)
        }
      ~ unique_id             = "AROAXFXZRL24MGE5TVII3" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      ~ id         = "terraform-registryTaskExecutionRole-20240302194935897700000009" -> (known after apply)
      ~ role       = "terraform-registryTaskExecutionRole" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.ecs.aws_security_group.backend_extra will be destroyed
  # (because aws_security_group.backend_extra is not in configuration)
  - resource "aws_security_group" "backend_extra" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group/sg-0df97e04eee18cc72" -> null
      - description            = "Backend extrac security group for service terraform-registry" -> null
      - egress                 = [] -> null
      - id                     = "sg-0df97e04eee18cc72" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "ECS reserved ports for service terraform-registry"
              - from_port        = 2375
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 2376
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "ECS user traffic ports for service terraform-registry"
              - from_port        = 32768
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 65535
            },
        ] -> null
      - name                   = "terraform-registry-20240302194935069000000005" -> null
      - name_prefix            = "terraform-registry-" -> null
      - owner_id               = "493370826424" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "ECS terraform-registry backend"
        } -> null
      - tags_all               = {
          - "Name"        = "ECS terraform-registry backend"
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
      - vpc_id                 = "vpc-08e19d859c26d18b2" -> null
    }

  # module.ecs.aws_vpc_security_group_ingress_rule.backend_extra_reserved will be destroyed
  # (because aws_vpc_security_group_ingress_rule.backend_extra_reserved is not in configuration)
  - resource "aws_vpc_security_group_ingress_rule" "backend_extra_reserved" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-000ecebf750fc1bf1" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - description            = "ECS reserved ports for service terraform-registry" -> null
      - from_port              = 2375 -> null
      - id                     = "sgr-000ecebf750fc1bf1" -> null
      - ip_protocol            = "tcp" -> null
      - security_group_id      = "sg-0df97e04eee18cc72" -> null
      - security_group_rule_id = "sgr-000ecebf750fc1bf1" -> null
      - tags                   = {
          - "Name" = "ECS reserved"
        } -> null
      - tags_all               = {
          - "Name"        = "ECS reserved"
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
      - to_port                = 2376 -> null
    }

  # module.ecs.aws_vpc_security_group_ingress_rule.backend_extra_user will be destroyed
  # (because aws_vpc_security_group_ingress_rule.backend_extra_user is not in configuration)
  - resource "aws_vpc_security_group_ingress_rule" "backend_extra_user" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-02b52993d3250d3a0" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - description            = "ECS user traffic ports for service terraform-registry" -> null
      - from_port              = 32768 -> null
      - id                     = "sgr-02b52993d3250d3a0" -> null
      - ip_protocol            = "tcp" -> null
      - security_group_id      = "sg-0df97e04eee18cc72" -> null
      - security_group_rule_id = "sgr-02b52993d3250d3a0" -> null
      - tags                   = {
          - "Name" = "ECS user traffic"
        } -> null
      - tags_all               = {
          - "Name"        = "ECS user traffic"
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
      - to_port                = 65535 -> null
    }

  # module.keycloak.aws_appautoscaling_policy.ecs_policy must be replaced
-/+ resource "aws_appautoscaling_policy" "ecs_policy" {
      ~ alarm_arns         = [
          - "arn:aws:cloudwatch:us-west-1:493370826424:alarm:TargetTracking-service/auth/auth-AlarmHigh-03960a74-86d0-4ac6-909b-ac782b280bd7",
          - "arn:aws:cloudwatch:us-west-1:493370826424:alarm:TargetTracking-service/auth/auth-AlarmLow-c0592987-c08f-4348-bd4c-bbf91b77b89a",
        ] -> (known after apply)
      ~ arn                = "arn:aws:autoscaling:us-west-1:493370826424:scalingPolicy:3346e5d2-4cc6-4047-be88-8b0be6538c37:resource/ecs/service/auth/auth:policyName/cpu-auto-scaling" -> (known after apply)
      ~ id                 = "cpu-auto-scaling" -> (known after apply)
      ~ name               = "cpu-auto-scaling" -> "auto-scaling" # forces replacement
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.keycloak.aws_ecs_capacity_provider.ecs will be updated in-place
  ~ resource "aws_ecs_capacity_provider" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:capacity-provider/auth"
        name     = "auth"
      ~ tags     = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/ecs/aws"
          + "environment"       = "development"
          + "module_version"    = "3.7.0"
          + "service"           = "auth"
        }
      ~ tags_all = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/ecs/aws"
          ~ "environment"       = "production" -> "development"
          + "module_version"    = "3.7.0"
          + "service"           = "auth"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.keycloak.aws_ecs_cluster.ecs will be updated in-place
  ~ resource "aws_ecs_cluster" "ecs" {
        id       = "arn:aws:ecs:us-west-1:493370826424:cluster/auth"
        name     = "auth"
      ~ tags     = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/ecs/aws"
          + "environment"       = "development"
          + "module_version"    = "3.7.0"
          + "service"           = "auth"
        }
      ~ tags_all = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/ecs/aws"
          ~ "environment"       = "production" -> "development"
          + "module_version"    = "3.7.0"
          + "service"           = "auth"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.keycloak.aws_ecs_service.ecs will be updated in-place
  ~ resource "aws_ecs_service" "ecs" {
        id                                 = "arn:aws:ecs:us-west-1:493370826424:service/auth/auth"
        name                               = "auth"
      ~ tags                               = {} -> (known after apply)
      ~ tags_all                           = {
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> (known after apply)
      ~ task_definition                    = "arn:aws:ecs:us-west-1:493370826424:task-definition/auth:9" -> (known after apply)
        # (14 unchanged attributes hidden)

      + timeouts {
          + delete = "10m"
        }

        # (4 unchanged blocks hidden)
    }

  # module.keycloak.aws_ecs_task_definition.ecs must be replaced
-/+ resource "aws_ecs_task_definition" "ecs" {
      ~ arn                      = "arn:aws:ecs:us-west-1:493370826424:task-definition/auth:9" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-1:493370826424:task-definition/auth" -> (known after apply)
      ~ container_definitions    = (sensitive value)
      ~ execution_role_arn       = "arn:aws:iam::493370826424:role/authTaskExecutionRole" -> (known after apply) # forces replacement
      ~ id                       = "auth" -> (known after apply)
      + network_mode             = (known after apply)
      - requires_compatibilities = [] -> null
      ~ revision                 = 9 -> (known after apply)
      ~ tags                     = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/ecs/aws"
          + "environment"       = "development"
          + "module_version"    = "3.7.0"
          + "service"           = "auth"
        }
      ~ tags_all                 = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/ecs/aws"
          ~ "environment"       = "production" -> "development"
          + "module_version"    = "3.7.0"
          + "service"           = "auth"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.keycloak.aws_iam_role.ecs_task_execution_role must be replaced
-/+ resource "aws_iam_role" "ecs_task_execution_role" {
      ~ arn                   = "arn:aws:iam::493370826424:role/authTaskExecutionRole" -> (known after apply)
      ~ create_date           = "2024-03-02T22:36:34Z" -> (known after apply)
      ~ id                    = "authTaskExecutionRole" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> (known after apply)
      ~ name                  = "authTaskExecutionRole" -> (known after apply)
      + name_prefix           = "authTaskExecutionRole" # forces replacement
      ~ tags                  = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/ecs/aws"
          + "environment"       = "development"
          + "module_version"    = "3.7.0"
          + "service"           = "auth"
        }
      ~ tags_all              = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/ecs/aws"
          ~ "environment"       = "production" -> "development"
          + "module_version"    = "3.7.0"
          + "service"           = "auth"
            # (1 unchanged element hidden)
        }
      ~ unique_id             = "AROAXFXZRL24KLHSL35DS" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ inline_policy (known after apply)
    }

  # module.keycloak.aws_iam_role_policy_attachment.ecs_task_execution_role_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      ~ id         = "authTaskExecutionRole-20240302223635181000000008" -> (known after apply)
      ~ role       = "authTaskExecutionRole" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak.aws_security_group.backend_extra will be destroyed
  # (because aws_security_group.backend_extra is not in configuration)
  - resource "aws_security_group" "backend_extra" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group/sg-08cca82b25623d4ee" -> null
      - description            = "Backend extrac security group for service auth" -> null
      - egress                 = [] -> null
      - id                     = "sg-08cca82b25623d4ee" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "ECS reserved ports for service auth"
              - from_port        = 2375
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 2376
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "ECS user traffic ports for service auth"
              - from_port        = 32768
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 65535
            },
        ] -> null
      - name                   = "auth-20240302223634861100000005" -> null
      - name_prefix            = "auth-" -> null
      - owner_id               = "493370826424" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "ECS auth backend"
        } -> null
      - tags_all               = {
          - "Name"        = "ECS auth backend"
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
      - vpc_id                 = "vpc-08e19d859c26d18b2" -> null
    }

  # module.keycloak.aws_vpc_security_group_ingress_rule.backend_extra_reserved will be destroyed
  # (because aws_vpc_security_group_ingress_rule.backend_extra_reserved is not in configuration)
  - resource "aws_vpc_security_group_ingress_rule" "backend_extra_reserved" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-08439d8ce172557ba" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - description            = "ECS reserved ports for service auth" -> null
      - from_port              = 2375 -> null
      - id                     = "sgr-08439d8ce172557ba" -> null
      - ip_protocol            = "tcp" -> null
      - security_group_id      = "sg-08cca82b25623d4ee" -> null
      - security_group_rule_id = "sgr-08439d8ce172557ba" -> null
      - tags                   = {
          - "Name" = "ECS reserved"
        } -> null
      - tags_all               = {
          - "Name"        = "ECS reserved"
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
      - to_port                = 2376 -> null
    }

  # module.keycloak.aws_vpc_security_group_ingress_rule.backend_extra_user will be destroyed
  # (because aws_vpc_security_group_ingress_rule.backend_extra_user is not in configuration)
  - resource "aws_vpc_security_group_ingress_rule" "backend_extra_user" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-0fb261fe3f35597f1" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - description            = "ECS user traffic ports for service auth" -> null
      - from_port              = 32768 -> null
      - id                     = "sgr-0fb261fe3f35597f1" -> null
      - ip_protocol            = "tcp" -> null
      - security_group_id      = "sg-08cca82b25623d4ee" -> null
      - security_group_rule_id = "sgr-0fb261fe3f35597f1" -> null
      - tags                   = {
          - "Name" = "ECS user traffic"
        } -> null
      - tags_all               = {
          - "Name"        = "ECS user traffic"
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
      - to_port                = 65535 -> null
    }

  # module.ecs.module.pod.data.aws_iam_policy_document.access_logs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "access_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::terraf-access-log-20240523222424593400000002/AWSLogs/493370826424/*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::027434742980:root",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.ecs.module.pod.aws_acm_certificate.website will be updated in-place
  ~ resource "aws_acm_certificate" "website" {
        id                        = "arn:aws:acm:us-west-1:493370826424:certificate/32a7b391-4cc3-48ff-8fc1-3f4994a9b351"
      ~ tags                      = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "terraform-registry"
        }
      ~ tags_all                  = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "terraform-registry"
            # (1 unchanged element hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.module.pod.aws_alb.website will be updated in-place
  ~ resource "aws_alb" "website" {
        id                                                           = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/terraf2024030219493612940000000a/1f20b225c3278266"
        name                                                         = "terraf2024030219493612940000000a"
      ~ tags                                                         = {
            "access_log_bucket"        = "terraf-access-log-20240523222424593400000002"
            "access_log_bucket_policy" = "terraf-access-log-20240523222424593400000002"
            "account"                  = "493370826424"
          + "created_by_module"        = "infrahouse/website-pod/aws"
            "environment"              = "development"
          - "managed-by"               = "terraform" -> null
            "service"                  = "terraform-registry"
        }
      ~ tags_all                                                     = {
          + "created_by_module"        = "infrahouse/website-pod/aws"
          - "managed-by"               = "terraform" -> null
            # (6 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.module.pod.aws_alb_target_group.website will be updated in-place
  ~ resource "aws_alb_target_group" "website" {
        id                                 = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20240302194935067400000002/c7f427e0e1d228fe"
        name                               = "tf-20240302194935067400000002"
      ~ tags                               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "terraform-registry"
        }
      ~ tags_all                           = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "terraform-registry"
            # (1 unchanged element hidden)
        }
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ecs.module.pod.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "terraf2024030219493674520000000d"
        name                             = "terraf2024030219493674520000000d"
        # (32 unchanged attributes hidden)

      + instance_maintenance_policy {
          + max_healthy_percentage = 200
          + min_healthy_percentage = 100
        }

      ~ launch_template {
            id      = "lt-0b338e0594e73e11a"
            name    = "terraf2024030219493659230000000b"
          ~ version = "2" -> (known after apply)
        }

      - tag {
          - key                 = "environment" -> null
          - propagate_at_launch = true -> null
          - value               = "development" -> null
        }
      - tag {
          - key                 = "managed-by" -> null
          - propagate_at_launch = true -> null
          - value               = "terraform" -> null
        }
      + tag {
          + key                 = "created_by"
          + propagate_at_launch = true
          + value               = "infrahouse/aws-control-493370826424"
        }
      + tag {
          + key                 = "created_by_module"
          + propagate_at_launch = true
          + value               = "infrahouse/website-pod/aws"
        }
      + tag {
          + key                 = "environment"
          + propagate_at_launch = true
          + value               = "production"
        }
      + tag {
          + key                 = "parent_module"
          + propagate_at_launch = true
          + value               = "infrahouse/ecs/aws"
        }
      + tag {
          + key                 = "parent_module_version"
          + propagate_at_launch = true
          + value               = "3.7.0"
        }

        # (5 unchanged blocks hidden)
    }

  # module.ecs.module.pod.aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                                   = "lt-0b338e0594e73e11a"
      ~ latest_version                       = 2 -> (known after apply)
        name                                 = "terraf2024030219493659230000000b"
        tags                                 = {}
      ~ user_data                            = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJ3cml0ZV9maWxlcyI6Ci0gImNvbnRlbnQiOiB8LQogICAgRUNTX0NMVVNURVI9dGVycmFmb3JtLXJlZ2lzdHJ5CiAgICBFQ1NfTE9HTEVWRUw9ZGVidWcKICAgIEVDU19BTExPV19PRkZIT1NUX0lOVFJPU1BFQ1RJT05fQUNDRVNTPXRydWUKICAicGF0aCI6ICIvZXRjL2Vjcy9lY3MuY29uZmlnIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgoNCi0tTUlNRUJPVU5EQVJZLS0NCg==" -> "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJydW5jbWQiOgotICJmYWxsb2NhdGUgLWwgMjA0OE0gL3N3YXBmaWxlIgotICJjaG1vZCA2MDAgL3N3YXBmaWxlIgotICJta3N3YXAgL3N3YXBmaWxlIgotICJzd2Fwb24gL3N3YXBmaWxlIgoid3JpdGVfZmlsZXMiOgotICJjb250ZW50IjogfC0KICAgIEVDU19DTFVTVEVSPXRlcnJhZm9ybS1yZWdpc3RyeQogICAgRUNTX0xPR0xFVkVMPWRlYnVnCiAgICBFQ1NfQUxMT1dfT0ZGSE9TVF9JTlRST1NQRUNUSU9OX0FDQ0VTUz10cnVlCiAgInBhdGgiOiAiL2V0Yy9lY3MvZWNzLmNvbmZpZyIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKDQotLU1JTUVCT1VOREFSWS0tDQo="
      ~ vpc_security_group_ids               = [
          - "sg-0df97e04eee18cc72",
            # (1 unchanged element hidden)
        ]
        # (15 unchanged attributes hidden)

      ~ iam_instance_profile {
          ~ arn  = "arn:aws:iam::493370826424:instance-profile/terraform-registry_instance" -> (known after apply)
            name = null
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "account"           = "493370826424"
              + "created_by"        = "infrahouse/aws-control-493370826424"
              + "created_by_module" = "infrahouse/website-pod/aws"
              + "environment"       = "development"
              + "service"           = "terraform-registry"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "account"           = "493370826424"
              + "created_by"        = "infrahouse/aws-control-493370826424"
              + "created_by_module" = "infrahouse/website-pod/aws"
              + "environment"       = "development"
              + "service"           = "terraform-registry"
            }
        }

        # (1 unchanged block hidden)
    }

  # module.ecs.module.pod.aws_lb_listener.ssl will be updated in-place
  ~ resource "aws_lb_listener" "ssl" {
        id                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/terraf2024030219493612940000000a/1f20b225c3278266/3a119c99d9f74ead"
      ~ tags              = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "terraform-registry"
        }
      ~ tags_all          = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "terraform-registry"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ecs.module.pod.aws_s3_bucket.access_log[0] will be updated in-place
  ~ resource "aws_s3_bucket" "access_log" {
        id                          = "terraf-access-log-20240523222424593400000002"
      ~ tags                        = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "terraform-registry"
        }
      ~ tags_all                    = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "terraform-registry"
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ecs.module.pod.aws_s3_bucket_policy.access_logs[0] will be updated in-place
  ~ resource "aws_s3_bucket_policy" "access_logs" {
        id     = "terraf-access-log-20240523222424593400000002"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::027434742980:root"
                        }
                      - Resource  = "arn:aws:s3:::terraf-access-log-20240523222424593400000002/AWSLogs/493370826424/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.ecs.module.pod.aws_security_group.alb will be updated in-place
  ~ resource "aws_security_group" "alb" {
        id                     = "sg-048f21fa3499d69af"
        name                   = "web-20240302194935069500000006"
      ~ tags                   = {
            "Name"              = "terraform-registry load balancer"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "terraform-registry"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "terraform-registry"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.ecs.module.pod.aws_security_group.backend will be updated in-place
  ~ resource "aws_security_group" "backend" {
        id                     = "sg-04b9363834e13a23e"
        name                   = "web-20240302194935067600000003"
      ~ tags                   = {
            "Name"              = "terraform-registry backend"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "terraform-registry"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "terraform-registry"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.ecs.module.pod.aws_vpc_security_group_egress_rule.alb_outgoing will be updated in-place
  ~ resource "aws_vpc_security_group_egress_rule" "alb_outgoing" {
        id                     = "sgr-0ff88016915a07fda"
      ~ tags                   = {
            "Name"              = "outgoing traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "terraform-registry"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "terraform-registry"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.ecs.module.pod.aws_vpc_security_group_egress_rule.backend_outgoing will be updated in-place
  ~ resource "aws_vpc_security_group_egress_rule" "backend_outgoing" {
        id                     = "sgr-0de12114d80af02de"
      ~ tags                   = {
            "Name"              = "outgoing traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "terraform-registry"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "terraform-registry"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.ecs.module.pod.aws_vpc_security_group_ingress_rule.alb_icmp will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "alb_icmp" {
        id                     = "sgr-0e10c5523b00f7c23"
      ~ tags                   = {
            "Name"              = "ICMP traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "terraform-registry"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "terraform-registry"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.ecs.module.pod.aws_vpc_security_group_ingress_rule.alb_listener_port will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "alb_listener_port" {
        id                     = "sgr-0c5501ac99c777076"
      ~ tags                   = {
            "Name"              = "user traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "terraform-registry"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "terraform-registry"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_icmp will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "backend_icmp" {
        id                     = "sgr-043d02ddfb9745980"
      ~ tags                   = {
            "Name"              = "ICMP traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "terraform-registry"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "terraform-registry"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_input[0] will be destroyed
  # (because index [0] is out of range for count)
  # (moved from module.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_input)
  - resource "aws_vpc_security_group_ingress_rule" "backend_ssh_input" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-07a5dea5dbb291aae" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - description            = "SSH access from the service specified CIDR range" -> null
      - from_port              = 22 -> null
      - id                     = "sgr-07a5dea5dbb291aae" -> null
      - ip_protocol            = "tcp" -> null
      - security_group_id      = "sg-04b9363834e13a23e" -> null
      - security_group_rule_id = "sgr-07a5dea5dbb291aae" -> null
      - tags                   = {
          - "Name" = "SSH additional"
        } -> null
      - tags_all               = {
          - "Name"        = "SSH additional"
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
      - to_port                = 22 -> null
    }

  # module.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_local will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "backend_ssh_local" {
        id                     = "sgr-004893c7e1cf4250f"
      ~ tags                   = {
            "Name"              = "SSH local"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "terraform-registry"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "terraform-registry"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.ecs.module.pod.aws_vpc_security_group_ingress_rule.backend_user_traffic must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "backend_user_traffic" {
      ~ arn                          = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-06aec0ef1d95a1378" -> (known after apply)
      - cidr_ipv4                    = "10.0.0.0/22" -> null # forces replacement
      ~ description                  = "User traffic from the Load Balancer" -> "Any traffic from the Load Balancer"
      - from_port                    = 8080 -> null
      ~ id                           = "sgr-06aec0ef1d95a1378" -> (known after apply)
      ~ ip_protocol                  = "tcp" -> "-1"
      + referenced_security_group_id = "sg-048f21fa3499d69af" # forces replacement
      ~ security_group_rule_id       = "sgr-06aec0ef1d95a1378" -> (known after apply)
      ~ tags                         = {
          ~ "Name"              = "user traffic" -> "Load balancer traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "terraform-registry"
        }
      ~ tags_all                     = {
          ~ "Name"              = "user traffic" -> "Load balancer traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "terraform-registry"
            # (1 unchanged element hidden)
        }
      - to_port                      = 8080 -> null
        # (1 unchanged attribute hidden)
    }

  # module.ecs.module.pod.aws_vpc_security_group_ingress_rule.https will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "https" {
        id                     = "sgr-0a32d4cf4fe9ff4af"
      ~ tags                   = {
            "Name"              = "https user traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "terraform-registry"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "terraform-registry"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.ecs.module.pod.random_string.profile_suffix will be created
  + resource "random_string" "profile_suffix" {
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.keycloak.module.pod.data.aws_iam_policy_document.access_logs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "access_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::auth-access-log-20240523222424592900000001/AWSLogs/493370826424/*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::027434742980:root",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.keycloak.module.pod.aws_acm_certificate.website will be updated in-place
  ~ resource "aws_acm_certificate" "website" {
        id                        = "arn:aws:acm:us-west-1:493370826424:certificate/833268fe-cb8e-4613-97cb-1f1548952f1a"
      ~ tags                      = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "auth"
        }
      ~ tags_all                  = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "auth"
            # (1 unchanged element hidden)
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.keycloak.module.pod.aws_alb.website will be updated in-place
  ~ resource "aws_alb" "website" {
        id                                                           = "arn:aws:elasticloadbalancing:us-west-1:493370826424:loadbalancer/app/auth2024030222363678900000000a/a26578ce41c8310c"
        name                                                         = "auth2024030222363678900000000a"
      ~ tags                                                         = {
            "access_log_bucket"        = "auth-access-log-20240523222424592900000001"
            "access_log_bucket_policy" = "auth-access-log-20240523222424592900000001"
            "account"                  = "493370826424"
          + "created_by_module"        = "infrahouse/website-pod/aws"
            "environment"              = "development"
          - "managed-by"               = "terraform" -> null
            "service"                  = "auth"
        }
      ~ tags_all                                                     = {
          + "created_by_module"        = "infrahouse/website-pod/aws"
          - "managed-by"               = "terraform" -> null
            # (6 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.keycloak.module.pod.aws_alb_target_group.website will be updated in-place
  ~ resource "aws_alb_target_group" "website" {
        id                                 = "arn:aws:elasticloadbalancing:us-west-1:493370826424:targetgroup/tf-20240302223634861300000006/781ece90bddd8d59"
        name                               = "tf-20240302223634861300000006"
      ~ tags                               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "auth"
        }
      ~ tags_all                           = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "auth"
            # (1 unchanged element hidden)
        }
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.keycloak.module.pod.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "auth2024030222363784960000000d"
        name                             = "auth2024030222363784960000000d"
        # (32 unchanged attributes hidden)

      + instance_maintenance_policy {
          + max_healthy_percentage = 200
          + min_healthy_percentage = 100
        }

      ~ launch_template {
            id      = "lt-0d93139ab32de43aa"
            name    = "auth2024030222363750480000000b"
          ~ version = "2" -> (known after apply)
        }

      - tag {
          - key                 = "environment" -> null
          - propagate_at_launch = true -> null
          - value               = "development" -> null
        }
      - tag {
          - key                 = "managed-by" -> null
          - propagate_at_launch = true -> null
          - value               = "terraform" -> null
        }
      + tag {
          + key                 = "created_by"
          + propagate_at_launch = true
          + value               = "infrahouse/aws-control-493370826424"
        }
      + tag {
          + key                 = "created_by_module"
          + propagate_at_launch = true
          + value               = "infrahouse/website-pod/aws"
        }
      + tag {
          + key                 = "environment"
          + propagate_at_launch = true
          + value               = "production"
        }
      + tag {
          + key                 = "parent_module"
          + propagate_at_launch = true
          + value               = "infrahouse/ecs/aws"
        }
      + tag {
          + key                 = "parent_module_version"
          + propagate_at_launch = true
          + value               = "3.7.0"
        }

        # (5 unchanged blocks hidden)
    }

  # module.keycloak.module.pod.aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                                   = "lt-0d93139ab32de43aa"
      ~ latest_version                       = 2 -> (known after apply)
        name                                 = "auth2024030222363750480000000b"
        tags                                 = {}
      ~ user_data                            = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJ3cml0ZV9maWxlcyI6Ci0gImNvbnRlbnQiOiB8LQogICAgRUNTX0NMVVNURVI9YXV0aAogICAgRUNTX0xPR0xFVkVMPWRlYnVnCiAgICBFQ1NfQUxMT1dfT0ZGSE9TVF9JTlRST1NQRUNUSU9OX0FDQ0VTUz10cnVlCiAgInBhdGgiOiAiL2V0Yy9lY3MvZWNzLmNvbmZpZyIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKDQotLU1JTUVCT1VOREFSWS0tDQo=" -> "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJydW5jbWQiOgotICJmYWxsb2NhdGUgLWwgNDA5Nk0gL3N3YXBmaWxlIgotICJjaG1vZCA2MDAgL3N3YXBmaWxlIgotICJta3N3YXAgL3N3YXBmaWxlIgotICJzd2Fwb24gL3N3YXBmaWxlIgoid3JpdGVfZmlsZXMiOgotICJjb250ZW50IjogfC0KICAgIEVDU19DTFVTVEVSPWF1dGgKICAgIEVDU19MT0dMRVZFTD1kZWJ1ZwogICAgRUNTX0FMTE9XX09GRkhPU1RfSU5UUk9TUEVDVElPTl9BQ0NFU1M9dHJ1ZQogICJwYXRoIjogIi9ldGMvZWNzL2Vjcy5jb25maWciCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCg0KLS1NSU1FQk9VTkRBUlktLQ0K"
      ~ vpc_security_group_ids               = [
          - "sg-08cca82b25623d4ee",
            # (1 unchanged element hidden)
        ]
        # (15 unchanged attributes hidden)

      ~ iam_instance_profile {
          ~ arn  = "arn:aws:iam::493370826424:instance-profile/auth_instance" -> (known after apply)
            name = null
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "account"           = "493370826424"
              + "created_by"        = "infrahouse/aws-control-493370826424"
              + "created_by_module" = "infrahouse/website-pod/aws"
              + "environment"       = "development"
              + "service"           = "auth"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "account"           = "493370826424"
              + "created_by"        = "infrahouse/aws-control-493370826424"
              + "created_by_module" = "infrahouse/website-pod/aws"
              + "environment"       = "development"
              + "service"           = "auth"
            }
        }

        # (1 unchanged block hidden)
    }

  # module.keycloak.module.pod.aws_lb_listener.ssl will be updated in-place
  ~ resource "aws_lb_listener" "ssl" {
        id                = "arn:aws:elasticloadbalancing:us-west-1:493370826424:listener/app/auth2024030222363678900000000a/a26578ce41c8310c/97b5ffe4c9e007df"
      ~ tags              = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "auth"
        }
      ~ tags_all          = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "auth"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.keycloak.module.pod.aws_s3_bucket.access_log[0] will be updated in-place
  ~ resource "aws_s3_bucket" "access_log" {
        id                          = "auth-access-log-20240523222424592900000001"
      ~ tags                        = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "auth"
        }
      ~ tags_all                    = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "auth"
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.keycloak.module.pod.aws_s3_bucket_policy.access_logs[0] will be updated in-place
  ~ resource "aws_s3_bucket_policy" "access_logs" {
        id     = "auth-access-log-20240523222424592900000001"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::027434742980:root"
                        }
                      - Resource  = "arn:aws:s3:::auth-access-log-20240523222424592900000001/AWSLogs/493370826424/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.keycloak.module.pod.aws_security_group.alb will be updated in-place
  ~ resource "aws_security_group" "alb" {
        id                     = "sg-04a8761a74826b4f8"
        name                   = "web-20240302223634859900000004"
      ~ tags                   = {
            "Name"              = "auth load balancer"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "auth"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "auth"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.keycloak.module.pod.aws_security_group.backend will be updated in-place
  ~ resource "aws_security_group" "backend" {
        id                     = "sg-06533e906d784b2a5"
        name                   = "web-20240302223634852900000002"
      ~ tags                   = {
            "Name"              = "auth backend"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "auth"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "auth"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.keycloak.module.pod.aws_vpc_security_group_egress_rule.alb_outgoing will be updated in-place
  ~ resource "aws_vpc_security_group_egress_rule" "alb_outgoing" {
        id                     = "sgr-08c12a045e8ba9745"
      ~ tags                   = {
            "Name"              = "outgoing traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "auth"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "auth"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.keycloak.module.pod.aws_vpc_security_group_egress_rule.backend_outgoing will be updated in-place
  ~ resource "aws_vpc_security_group_egress_rule" "backend_outgoing" {
        id                     = "sgr-084a4b4a7956275e6"
      ~ tags                   = {
            "Name"              = "outgoing traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "auth"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "auth"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.alb_icmp will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "alb_icmp" {
        id                     = "sgr-05b0c467d0cc6084a"
      ~ tags                   = {
            "Name"              = "ICMP traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "auth"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "auth"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.alb_listener_port will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "alb_listener_port" {
        id                     = "sgr-0cc902990fde04156"
      ~ tags                   = {
            "Name"              = "user traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "auth"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "auth"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_icmp will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "backend_icmp" {
        id                     = "sgr-0da95d368ec0bcbdb"
      ~ tags                   = {
            "Name"              = "ICMP traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "auth"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "auth"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_input[0] will be destroyed
  # (because index [0] is out of range for count)
  # (moved from module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_input)
  - resource "aws_vpc_security_group_ingress_rule" "backend_ssh_input" {
      - arn                    = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-0ec0eed9f3d8a3ab7" -> null
      - cidr_ipv4              = "0.0.0.0/0" -> null
      - description            = "SSH access from the service specified CIDR range" -> null
      - from_port              = 22 -> null
      - id                     = "sgr-0ec0eed9f3d8a3ab7" -> null
      - ip_protocol            = "tcp" -> null
      - security_group_id      = "sg-06533e906d784b2a5" -> null
      - security_group_rule_id = "sgr-0ec0eed9f3d8a3ab7" -> null
      - tags                   = {
          - "Name" = "SSH additional"
        } -> null
      - tags_all               = {
          - "Name"        = "SSH additional"
          - "created_by"  = "infrahouse/aws-control-493370826424"
          - "environment" = "production"
        } -> null
      - to_port                = 22 -> null
    }

  # module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_ssh_local will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "backend_ssh_local" {
        id                     = "sgr-0bbb79202dde3e83d"
      ~ tags                   = {
            "Name"              = "SSH local"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "auth"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "auth"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.backend_user_traffic must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "backend_user_traffic" {
      ~ arn                          = "arn:aws:ec2:us-west-1:493370826424:security-group-rule/sgr-0d168218efcb7219b" -> (known after apply)
      - cidr_ipv4                    = "10.0.0.0/22" -> null # forces replacement
      ~ description                  = "User traffic from the Load Balancer" -> "Any traffic from the Load Balancer"
      - from_port                    = 8080 -> null
      ~ id                           = "sgr-0d168218efcb7219b" -> (known after apply)
      ~ ip_protocol                  = "tcp" -> "-1"
      + referenced_security_group_id = "sg-04a8761a74826b4f8" # forces replacement
      ~ security_group_rule_id       = "sgr-0d168218efcb7219b" -> (known after apply)
      ~ tags                         = {
          ~ "Name"              = "user traffic" -> "Load balancer traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "auth"
        }
      ~ tags_all                     = {
          ~ "Name"              = "user traffic" -> "Load balancer traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "auth"
            # (1 unchanged element hidden)
        }
      - to_port                      = 8080 -> null
        # (1 unchanged attribute hidden)
    }

  # module.keycloak.module.pod.aws_vpc_security_group_ingress_rule.https will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "https" {
        id                     = "sgr-08092ae9826c38ee9"
      ~ tags                   = {
            "Name"              = "https user traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "auth"
        }
      ~ tags_all               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          ~ "environment"       = "production" -> "development"
          + "service"           = "auth"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.keycloak.module.pod.random_string.profile_suffix will be created
  + resource "random_string" "profile_suffix" {
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ecs.module.pod.module.instance_profile.aws_iam_instance_profile.profile will be created
  + resource "aws_iam_instance_profile" "profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all    = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
      + unique_id   = (known after apply)
    }

  # module.ecs.module.pod.module.instance_profile.aws_iam_policy.profile will be created
  + resource "aws_iam_policy" "profile" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:Describe*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "ecs:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
    }

  # module.ecs.module.pod.module.instance_profile.aws_iam_role.profile will be created
  + resource "aws_iam_role" "profile" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs.module.pod.module.instance_profile.aws_iam_role_policy_attachment.profile will be created
  + resource "aws_iam_role_policy_attachment" "profile" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.ecs.module.pod.module.webserver_profile.aws_iam_instance_profile.profile will be destroyed
  # (because aws_iam_instance_profile.profile is not in configuration)
  - resource "aws_iam_instance_profile" "profile" {
      - arn         = "arn:aws:iam::493370826424:instance-profile/terraform-registry_instance" -> null
      - create_date = "2024-03-02T19:49:35Z" -> null
      - id          = "terraform-registry_instance" -> null
      - name        = "terraform-registry_instance" -> null
      - path        = "/" -> null
      - role        = "terraform-registry_instance20240302194935069800000007" -> null
      - tags        = {
          - "created_by_module" = "infrahouse/instance-profile/aws"
        } -> null
      - tags_all    = {
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/instance-profile/aws"
          - "environment"       = "production"
        } -> null
      - unique_id   = "AIPAXFXZRL24B57KGDDVR" -> null
        # (1 unchanged attribute hidden)
    }

  # module.ecs.module.pod.module.webserver_profile.aws_iam_policy.profile will be destroyed
  # (because aws_iam_policy.profile is not in configuration)
  - resource "aws_iam_policy" "profile" {
      - arn              = "arn:aws:iam::493370826424:policy/terraform-registry_instance20240302194935067200000001" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::493370826424:policy/terraform-registry_instance20240302194935067200000001" -> null
      - name             = "terraform-registry_instance20240302194935067200000001" -> null
      - name_prefix      = "terraform-registry_instance" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ec2:Describe*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "ecs:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAXFXZRL24DJDYVTP7Y" -> null
      - tags             = {
          - "created_by_module" = "infrahouse/instance-profile/aws"
        } -> null
      - tags_all         = {
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/instance-profile/aws"
          - "environment"       = "production"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.ecs.module.pod.module.webserver_profile.aws_iam_role.profile will be destroyed
  # (because aws_iam_role.profile is not in configuration)
  - resource "aws_iam_role" "profile" {
      - arn                   = "arn:aws:iam::493370826424:role/terraform-registry_instance20240302194935069800000007" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-03-02T19:49:35Z" -> null
      - force_detach_policies = false -> null
      - id                    = "terraform-registry_instance20240302194935069800000007" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::493370826424:policy/terraform-registry_instance20240302194935067200000001",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "terraform-registry_instance20240302194935069800000007" -> null
      - name_prefix           = "terraform-registry_instance" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "created_by_module" = "infrahouse/instance-profile/aws"
        } -> null
      - tags_all              = {
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/instance-profile/aws"
          - "environment"       = "production"
        } -> null
      - unique_id             = "AROAXFXZRL24EIDISCTNV" -> null
        # (2 unchanged attributes hidden)
    }

  # module.ecs.module.pod.module.webserver_profile.aws_iam_role_policy_attachment.profile will be destroyed
  # (because aws_iam_role_policy_attachment.profile is not in configuration)
  - resource "aws_iam_role_policy_attachment" "profile" {
      - id         = "terraform-registry_instance20240302194935069800000007-20240302194935884600000008" -> null
      - policy_arn = "arn:aws:iam::493370826424:policy/terraform-registry_instance20240302194935067200000001" -> null
      - role       = "terraform-registry_instance20240302194935069800000007" -> null
    }

  # module.keycloak.module.pod.module.instance_profile.aws_iam_instance_profile.profile will be created
  + resource "aws_iam_instance_profile" "profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all    = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
      + unique_id   = (known after apply)
    }

  # module.keycloak.module.pod.module.instance_profile.aws_iam_policy.profile will be created
  + resource "aws_iam_policy" "profile" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:Describe*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "ecs:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
    }

  # module.keycloak.module.pod.module.instance_profile.aws_iam_role.profile will be created
  + resource "aws_iam_role" "profile" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.keycloak.module.pod.module.instance_profile.aws_iam_role_policy_attachment.profile will be created
  + resource "aws_iam_role_policy_attachment" "profile" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.keycloak.module.pod.module.webserver_profile.aws_iam_instance_profile.profile will be destroyed
  # (because aws_iam_instance_profile.profile is not in configuration)
  - resource "aws_iam_instance_profile" "profile" {
      - arn         = "arn:aws:iam::493370826424:instance-profile/auth_instance" -> null
      - create_date = "2024-03-02T22:36:35Z" -> null
      - id          = "auth_instance" -> null
      - name        = "auth_instance" -> null
      - path        = "/" -> null
      - role        = "auth_instance20240302223634852000000001" -> null
      - tags        = {
          - "created_by_module" = "infrahouse/instance-profile/aws"
        } -> null
      - tags_all    = {
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/instance-profile/aws"
          - "environment"       = "production"
        } -> null
      - unique_id   = "AIPAXFXZRL24M34ZXH7G6" -> null
        # (1 unchanged attribute hidden)
    }

  # module.keycloak.module.pod.module.webserver_profile.aws_iam_policy.profile will be destroyed
  # (because aws_iam_policy.profile is not in configuration)
  - resource "aws_iam_policy" "profile" {
      - arn              = "arn:aws:iam::493370826424:policy/auth_instance20240302223634853400000003" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::493370826424:policy/auth_instance20240302223634853400000003" -> null
      - name             = "auth_instance20240302223634853400000003" -> null
      - name_prefix      = "auth_instance" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ec2:Describe*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "ecs:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAXFXZRL24DZDEBZ5AX" -> null
      - tags             = {
          - "created_by_module" = "infrahouse/instance-profile/aws"
        } -> null
      - tags_all         = {
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/instance-profile/aws"
          - "environment"       = "production"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.keycloak.module.pod.module.webserver_profile.aws_iam_role.profile will be destroyed
  # (because aws_iam_role.profile is not in configuration)
  - resource "aws_iam_role" "profile" {
      - arn                   = "arn:aws:iam::493370826424:role/auth_instance20240302223634852000000001" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-03-02T22:36:34Z" -> null
      - force_detach_policies = false -> null
      - id                    = "auth_instance20240302223634852000000001" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::493370826424:policy/auth_instance20240302223634853400000003",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "auth_instance20240302223634852000000001" -> null
      - name_prefix           = "auth_instance" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "created_by_module" = "infrahouse/instance-profile/aws"
        } -> null
      - tags_all              = {
          - "created_by"        = "infrahouse/aws-control-493370826424"
          - "created_by_module" = "infrahouse/instance-profile/aws"
          - "environment"       = "production"
        } -> null
      - unique_id             = "AROAXFXZRL24JLWVMO6LT" -> null
        # (2 unchanged attributes hidden)
    }

  # module.keycloak.module.pod.module.webserver_profile.aws_iam_role_policy_attachment.profile will be destroyed
  # (because aws_iam_role_policy_attachment.profile is not in configuration)
  - resource "aws_iam_role_policy_attachment" "profile" {
      - id         = "auth_instance20240302223634852000000001-20240302223635213800000009" -> null
      - policy_arn = "arn:aws:iam::493370826424:policy/auth_instance20240302223634853400000003" -> null
      - role       = "auth_instance20240302223634852000000001" -> null
    }

Plan: 20 to add, 40 to change, 26 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDIwLCAiY2hhbmdlIjogNDAsICJkZXN0cm95IjogMjZ9fQ==
```
</details>